In [1]:
import numpy as np
import pandas as pd

In [2]:
from rpy2.robjects import r
from rpy2.robjects.pandas2ri import ri2py

r('library(MASS)')
boston = ri2py(r('Boston'))

We add few columns and datats for exercise proposes

In [3]:
boston['inverse_zn'] = 1/boston['zn']
boston['ones'] = boston['inverse_zn'] * boston['zn']
boston['stupid'] = 'stupid'

boston2 = boston[['medv', 'ones']]

boston_lstat = boston[['lstat', 'medv']]
boston.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,inverse_zn,ones,stupid
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0,0.055556,1.0,stupid
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6,inf,NaN,stupid
3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7,inf,NaN,stupid
4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4,inf,NaN,stupid
5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2,inf,NaN,stupid

### 1. Renaming columns in pandas
http://stackoverflow.com/questions/11346283/renaming-columns-in-pandas

Rename columns in boston_lstat to 'lower_status', 'median_value'

In [5]:
boston_lstat.columns=['lower_status','median_value']

### 2. Delete column from pandas DataFrame
http://stackoverflow.com/questions/13411544/delete-column-from-pandas-dataframe

Delete 'stupid' column from boston.

In [12]:
if 'stupid' in boston.columns:
    boston.drop('stupid', axis = 1, inplace=True)
    
if 'stupid' in boston.columns:
    del boston['stupid']

boston.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,inverse_zn,ones
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0,0.055556,1.0
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6,inf,NaN
3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7,inf,NaN
4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4,inf,NaN
5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2,inf,NaN

### 3. Adding new column to existing DataFrame in Python pandas

http://stackoverflow.com/questions/12555323/adding-new-column-to-existing-dataframe-in-python-pandas

Create boston3 DataFrame that contains all rows from boston2 that have 'medv' > 24. Then create new column 'normal' and assign to each row a number sampled from normal distribution with mu=100 and sigma=20.

In [46]:
boston3 = boston[boston['medv'] >24].copy()
boston3.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,inverse_zn,ones
3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7,inf,NaN
4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4,inf,NaN
5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2,inf,NaN
6,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222.0,18.7,394.12,5.21,28.7,inf,NaN
8,0.14455,12.5,7.87,0,0.524,6.172,96.1,5.9505,5,311.0,15.2,396.90,19.15,27.1,0.080000,1.0

### 4. add one row in a pandas.DataFrame

http://stackoverflow.com/questions/10715965/add-one-row-in-a-pandas-dataframe

I understand that pandas is designed to load fully populated DataFrame but I need to create an empty DataFrame then add rows, one by one. What is the best way to do this ?

Create empty DataFrame 'best_dses' with columns 'people' and 'salary', and then add rows, one by one:
"Carlos" 1,000,000, 
"Aleix" 10,000
"Bartek" 8,000.

In [19]:
bd = pd.DataFrame(columns = ['people','salary'])
bd.loc[0] = ['Carlos', 10000]
bd.loc[1] = {'people':'Aleix', 'salary': 1000}
bd.loc[2] = {'salary': 20000, 'people':'Bartek'}
bd.head()

   people   salary
0  Carlos  10000.0
1   Aleix   1000.0
2  Bartek  20000.0

### 5. How to drop rows of Pandas dataframe whose value of certain column is NaN
http://stackoverflow.com/questions/13413590/how-to-drop-rows-of-pandas-dataframe-whose-value-of-certain-column-is-nan

Do it with boston2's column 'ones'.

In [24]:
boston2.dropna(axis=0, subset=['ones'], inplace=True)
boston2.head()

/home/luca/.local/lib/python3.4/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

    medv  ones
1   24.0   1.0
7   22.9   1.0
8   27.1   1.0
9   16.5   1.0
10  18.9   1.0

### 6. Pandas: change data type of columns
http://stackoverflow.com/questions/15891038/pandas-change-data-type-of-columns

Change type of column salary in best_dses to int (or to float if already it is int).

In [34]:
bd['salary'] = bd['salary'].astype(np.int64)
bd['salary'].dtype

dtype('int64')

### 7. Selecting columns
http://stackoverflow.com/questions/11285613/selecting-columns

Select columns 'age' and 'lstat' from boston and save it to boston_select DataFrame

In [37]:
boston_select = boston[['age','lstat']].copy()
boston_select.head()

    age  lstat
1  65.2   4.98
2  78.9   9.14
3  61.1   4.03
4  45.8   2.94
5  54.2   5.33

### 8. Get list from pandas DataFrame column headers
http://stackoverflow.com/questions/19482970/get-list-from-pandas-dataframe-column-headers

get list of column names of boston

In [38]:
boston.columns

Index(['crim', 'zn', 'indus', 'chas', 'nox', 'rm', 'age', 'dis', 'rad', 'tax',
       'ptratio', 'black', 'lstat', 'medv', 'inverse_zn', 'ones'],
      dtype='object')

### 9. How to filter the DataFrame rows of pandas by “within”/“in”? (use a list of values to select rows from a pandas dataframe)

http://stackoverflow.com/questions/12065885/how-to-filter-the-dataframe-rows-of-pandas-by-within-in
http://stackoverflow.com/questions/12096252/use-a-list-of-values-to-select-rows-from-a-pandas-dataframe

Select rows from boston that hav values from list [24, 21.6] in column 'medv'

In [42]:
boston[boston['medv'].isin([24,21.6])]

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,inverse_zn,ones
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0,0.055556,1.0
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6,inf,NaN
236,0.33045,0.0,6.20,0,0.507,6.086,61.5,3.6519,8,307.0,17.4,376.75,10.88,24.0,inf,NaN
314,0.26938,0.0,9.90,0,0.544,6.266,82.8,3.2628,4,304.0,18.4,393.39,7.90,21.6,inf,NaN

### 10. Convert list of dictionaries to Dataframe
http://stackoverflow.com/questions/20638006/convert-list-of-dictionaries-to-dataframe

Transform best_dses.to_dict('records') to DataFrame

In [44]:
x = bd.to_dict('records')
pd.DataFrame(x)

   people  salary
0  Carlos   10000
1   Aleix    1000
2  Bartek   20000